---
kind: property
id: P:Autodesk.Revit.DB.Visual.Generic.GenericSelfIllumFilterMap
source: html/0ecc4361-720d-6361-17d1-ec0944365de3.htm
---
# Autodesk.Revit.DB.Visual.Generic.GenericSelfIllumFilterMap Property

The property labeled "Filter Color" from the "Generic" schema.

## Syntax (C#)
```csharp
public static string GenericSelfIllumFilterMap { get; }
```

## Remarks
This property is of type "AssetPropertyDoubleArray4d".
 This property allows a connected asset.